

# removing targets
delete_target = ['TRAIN_00039', 'TRAIN_01222', 'TRAIN_01228', 'TRAIN_02704', 
                 'TRAIN_03381', 'TRAIN_05506', 'TRAIN_05549', 'TRAIN_06271', 
                 'TRAIN_11353', 'TRAIN_13573', 'TRAIN_15142', 'TRAIN_15403', 
                 'TRAIN_00087', 'TRAIN_00326', 'TRAIN_00418', 'TRAIN_00464', 
                 'TRAIN_00883', 'TRAIN_01862', 'TRAIN_01928', 'TRAIN_03345', 
                 'TRAIN_04041', 'TRAIN_04565', 'TRAIN_05194', 'TRAIN_06995', 
                 'TRAIN_07893', 'TRAIN_10204', 'TRAIN_11192', 'TRAIN_11457', 
                 'TRAIN_13538', 'TRAIN_14669', 'TRAIN_14862', 'TRAIN_00090', 
                 'TRAIN_00786', 'TRAIN_00960', 'TRAIN_01994', 'TRAIN_02085', 
                 'TRAIN_02786', 'TRAIN_03535', 'TRAIN_03675', 'TRAIN_04731', 
                 'TRAIN_05266', 'TRAIN_05550', 'TRAIN_05873', 'TRAIN_06735', 
                 'TRAIN_07236', 'TRAIN_08260', 'TRAIN_11033', 'TRAIN_12701', 
                 'TRAIN_13030', 'TRAIN_13197', 'TRAIN_13560', 'TRAIN_14090', 
                 'TRAIN_14427', 'TRAIN_15264', 'TRAIN_15408', 'TRAIN_15613', 
                 'TRAIN_16274', 'TRAIN_00095', 'TRAIN_00308', 'TRAIN_00537', 
                 'TRAIN_02205', 'TRAIN_02302', 'TRAIN_02579', 'TRAIN_02714', 
                 'TRAIN_03045', 'TRAIN_03090', 'TRAIN_03654', 'TRAIN_03893', 
                 'TRAIN_03908', 'TRAIN_04537', 'TRAIN_05168', 'TRAIN_05315', 
                 'TRAIN_06699', 'TRAIN_07115', 'TRAIN_07647', 'TRAIN_07920', 
                 'TRAIN_08135', 'TRAIN_08549', 'TRAIN_08691', 'TRAIN_09713', 
                 'TRAIN_10114', 'TRAIN_10144', 'TRAIN_10398', 'TRAIN_10416', 
                 'TRAIN_10539', 'TRAIN_12834', 'TRAIN_12875', 'TRAIN_13044', 
                 'TRAIN_13675', 'TRAIN_15090', 'TRAIN_15133', 'TRAIN_15451', 
                 'TRAIN_15518', 'TRAIN_15680', 'TRAIN_16698', 'TRAIN_16713', 
                 'TRAIN_00100', 'TRAIN_01510', 'TRAIN_08161', 'TRAIN_09849', 
                 'TRAIN_12212', 'TRAIN_00027', 'TRAIN_00394', 'TRAIN_02738', 
                 'TRAIN_02962', 'TRAIN_03533', 'TRAIN_03666', 'TRAIN_04990', 
                 'TRAIN_05081', 'TRAIN_05713', 'TRAIN_06531', 'TRAIN_09427', 
                 'TRAIN_12844', 'TRAIN_15844', 'TRAIN_01809', 'TRAIN_02059', 
                 'TRAIN_02784', 'TRAIN_02810', 'TRAIN_06598', 'TRAIN_10590', 
                 'TRAIN_11594', 'TRAIN_12193', 'TRAIN_14187', 'TRAIN_14529', 
                 'TRAIN_14768', 'TRAIN_00208', 'TRAIN_00681', 'TRAIN_02907', 
                 'TRAIN_03135', 'TRAIN_03204', 'TRAIN_04117', 'TRAIN_04980', 
                 'TRAIN_06098', 'TRAIN_06633', 'TRAIN_09576', 'TRAIN_09852', 
                 'TRAIN_11912', 'TRAIN_12804', 'TRAIN_13161', 'TRAIN_14499', 
                 'TRAIN_14752', 'TRAIN_14870', 'TRAIN_15441', 'TRAIN_16439', 
                 'TRAIN_16778', 'TRAIN_16791', 'TRAIN_00214', 'TRAIN_01278', 
                 'TRAIN_03477', 'TRAIN_05324', 'TRAIN_12259', 'TRAIN_00228', 
                 'TRAIN_03494', 'TRAIN_04128', 'TRAIN_04644', 'TRAIN_07105', 
                 'TRAIN_10217', 'TRAIN_12618', 'TRAIN_13930', 'TRAIN_16546', 
                 'TRAIN_16775']

restaurant_target = ["한식", "중식", "일식", "서양식"]
restaurant_error_words = [
    [
    "서양식", "양식전문점", "양식전문", "양식 전문점", "양식 전문", "양식요리", "양식 요리", "서양요리", "서양 요리", "서양음식", "서양 음식",
    "일식", "일식전문점", "일식전문", "일식 전문점", "일식 전문", "일식요리", "일식 요리", "일본요리", "일본 요리", "일본음식", "일본 음식",
    "중식", "중식전문점", "중식전문", "중식 전문점", "중식 전문", "중식요리", "중식 요리", "중국요리", "중국 요리", "중국음식", "중국 음식"
    ],   
    [
    "서양식", "양식전문점", "양식전문", "양식 전문점", "양식 전문", "양식요리", "양식 요리", "서양요리", "서양 요리", "서양음식", "서양 음식",
    "일식", "일식전문점", "일식전문", "일식 전문점", "일식 전문", "일식요리", "일식 요리", "일본요리", "일본 요리", "일본음식", "일본 음식",
    "한식", "한식전문점", "한식전문", "한식 전문점", "한식 전문", "한식요리", "한식 요리", "한국요리", "한국 요리", "한국음식", "한국 음식"
    ],
    [
    "서양식", "양식전문점", "양식전문", "양식 전문점", "양식 전문", "양식요리", "양식 요리", "서양요리", "서양 요리", "서양음식", "서양 음식",
    "중식", "중식전문점", "중식전문", "중식 전문점", "중식 전문", "중식요리", "중식 요리", "중국요리", "중국 요리", "중국음식", "중국 음식",
    "한식", "한식전문점", "한식전문", "한식 전문점", "한식 전문", "한식요리", "한식 요리", "한국요리", "한국 요리", "한국음식", "한국 음식"
    ],
    [
    "일식", "일식전문점", "일식전문", "일식 전문점", "일식 전문", "일식요리", "일식 요리", "일본요리", "일본 요리", "일본음식", "일본 음식",
    "중식", "중식전문점", "중식전문", "중식 전문점", "중식 전문", "중식요리", "중식 요리", "중국요리", "중국 요리", "중국음식", "중국 음식",
    "한식", "한식전문점", "한식전문", "한식 전문점", "한식 전문", "한식요리", "한식 요리", "한국요리", "한국 요리", "한국음식", "한국 음식"
    ]
]
restaurant_words_off = [
    ["한식", "보양식"],
    ["중식"],
    ["일식"],
    ["서양식", "스테이크"]
]


etc_target = [ "바/까페", "야영장,오토캠핑장", "모텔"]
etc_error_words_off = [
    ["카페", "까페", "찻집", "바", 
        "bar", "cafe", "커피", "쿠키", 
       "빵", "베이커리", "디저트","도넛", 
       "요거트", "전통차", "음료", "컨피", 
       "아메리카노", "카푸치노", "차 한잔", "차를 한잔", "녹차", "빙수"],
    ["야영장", "캠핑장", "캠핑", "캠프", "야영", "텐트","글램핑", "카라반", "휴양림"],
    ["모텔", "호텔", "숙박", "게스트", "객실", "온천", 
    "무인텔", "호스텔", "MOTEL", "motel", "hotel","HOTEL", "스키텔", "골프텔", 
    "하우스", "방 안"],
]

infer_result_based_target = ["섬", "전시관", "박물관", ]
infer_result_based_error_words = [
    ["걷기", "나들길"],
    ["카페", "까페", "공연장", "갤러리", "공원", "관광", 
     "박물관", "뮤지엄", "문화공간", "아울렛", "미술관", "페스티벌", "단군 왕검"],
    ["전시관", "생태공원","수련시설", "생활민속관", "테마파크", "테마공원", "오이도", "백제원", "보령머드체험관"  ],
]
infer_result_based_words_off=[
    [],
    ["전시관"],
    [],
]





# re-labeling targets
rename_target = [
    [954, 1900, 16742],
    [6638],
    [2092, 7158, 16085],
    [185, 1083, 3972, 5267, 11860, 16574],
    [779, 2412, 6417],
    [2251],
    [7671, 11351] ,
]
rename_label = ["서양식", "일식", "카페", "문화관광축제", "축제", "테마공원", "수목원"]